---
kind: other
id: Properties.T:Autodesk.Revit.DB.ImageTypeOptions
source: html/49c1091b-87f1-164d-cd50-c383d642fb00.htm
---
# ImageTypeOptions Properties

Specifies whether the .NET object represents a valid Revit entity.